Revit 2024 API
AnalysisDisplayStyle.HasDiagramSettings Method
 If true style has diagram settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool HasDiagramSettings()
Visual Basic
Public Function HasDiagramSettings As Boolean
Visual C++
public:
bool HasDiagramSettings()
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace